{
  "DT.INT.DLXF.CD": {
    "definition": "Interest payments on long-term debt are actual amounts of interest paid by the borrower in currency, goods, or services in the year specified. Long-term external debt is defined as debt that has an original or extended maturity of more than one year and that is owed to nonresidents by residents of an economy and repayable in currency, goods, or services. Data are in current U.S. dollars.",
    "unit": "Current US$ Million",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.TDS.DLXF.CD": {
    "definition": "Debt service payments are the sum of principal repayments and interest payments actually made in the year specified. Long-term external debt is defined as debt that has an original or extended maturity of more than one year and that is owed to nonresidents by residents of an economy and repayable in currency, goods, or services. Data are in current U.S. dollars.",
    "unit": "Current US$ Million",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.INR.DPPG": {
    "definition": "Interest represents the average interest rate on all new public and publicly guaranteed loans contracted during the year. To obtain the average, the interest rates for all public and publicly guaranteed loans have been weighted by the amounts of the loans. Public debt is an external obligation of a public debtor, including the national government, a political subdivision (or an agency of either), and autonomous public bodies. Publicly guaranteed debt is an external obligation of a private debtor that is guaranteed for repayment by a public entity.",
    "unit": "Percent (%)",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.INR.OFFT": {
    "definition": "Interest represents the average interest rate on all new public and publicly guaranteed loans contracted during the year. To obtain the average, the interest rates for all public and publicly guaranteed loans have been weighted by the amounts of the loans. Debt from official creditors includes loans from international organizations (multilateral loans) and loans from governments (bilateral loans). Loans from international organization include loans and credits from the World Bank, regional development banks, and other multilateral and intergovernmental agencies. Excluded are loans from funds administered by an international organization on behalf of a single donor government; these are classified as loans from governments. Government loans include loans from governments and their agencies (including central banks), loans from autonomous bodies, and direct loans from official export credit agencies.",
    "unit": "Percent (%)",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.INR.PRVT": {
    "definition": "Interest represents the average interest rate on all new public and publicly guaranteed loans contracted during the year. To obtain the average, the interest rates for all public and publicly guaranteed loans have been weighted by the amounts of the loans. Debt from private creditors include bonds that are either publicly issued or privately placed; commercial bank loans from private banks and other private financial institutions; and other private credits from manufacturers, exporters, and other suppliers of goods, and bank credits covered by a guarantee of an export credit agency.",
    "unit": "Percent (%)",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.DOD.DECT.GN.ZS": {
    "definition": "Total external debt stocks to gross national income. Total external debt is debt owed to nonresidents repayable in currency, goods, or services. Total external debt is the sum of public, publicly guaranteed, and private nonguaranteed long-term debt, use of IMF credit, and short-term debt. Short-term debt includes all debt having an original maturity of one year or less and interest in arrears on long-term debt. GNI (formerly GNP) is the sum of value added by all resident producers plus any product taxes (less subsidies) not included in the valuation of output plus net receipts of primary income (compensation of employees and property income) from abroad.",
    "unit": "Percent (%)",
    "source": "International Debt Statistics, World Bank (WB)"
  },
  "DT.DOD.DECT.EX.ZS": {
    "definition": "Total external debt stocks to exports of goods, services and primary income.",
    "unit": "Percent (%)",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.INT.DECT.GN.ZS": {
    "definition": "Total interest payments to gross national income.",
    "unit": "Percent (%)",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.IXR.DPPG.CD": {
    "definition": "Interest rescheduled is the amount of interest due or in arrears that was rescheduled in any given year. (Interest capitalized is the interest that became part of the stock of debt due to a rescheduling operation.) Data are in current U.S. dollars.",
    "unit": "Current US$",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.IXR.OFFT.CD": {
    "definition": "Interest rescheduled is the amount of interest due or in arrears that was rescheduled in any given year. Debt from official creditors includes loans from international organizations (multilateral loans) and loans from governments (bilateral loans). Loans from international organizations include loans and credits from the World Bank, regional development banks, and other multilateral and intergovernmental agencies. Excluded are loans from funds administered by an international organization on behalf of a single donor government; these are classified as loans from governments. Government loans include loans from governments and their agencies (including central banks), loans from autonomous bodies, and direct loans from official export credit agencies. Data are in current U.S. dollars.",
    "unit": "Current US$",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.INT.DSTC.CD": {
    "definition": "Interest payments on short-term debt are actual amounts of interest paid by the borrower in currency, goods, or services in the year specified. This item includes interest paid on long-term debt, IMF charges, and interest paid on short-term debt. Short-term external debt is defined as debt that has an original maturity of one year or less. Available data permit no distinction between public and private nonguaranteed short-term debt. Data are in current U.S. dollars.",
    "unit": "Current US$",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.INT.DECT.EX.ZS": {
    "definition": "Total interest payments to exports of goods, services and primary income. Total interest payment is the sum of interest actually paid in currency, goods, or services on long-term debt, interest paid on short-term debt, and charges to the IMF.",
    "unit": "Percent (%)",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.IXF.DPPG.CD": {
    "definition": "Interest forgiven is the amount of interest due or in arrears that was written off or forgiven in any given year. Data are in current U.S. dollars.",
    "unit": "Current US$",
    "source": "World Bank, International Debt Statistics."
  },
  "DT.IXR.PRVT.CD": {
    "definition": "Interest rescheduled is the amount of interest due or in arrears that was rescheduled in any given year. Debt from private creditors include bonds that are either publicly issued or privately placed; commercial bank loans from private banks and other private financial institutions; and other private credits from manufacturers, exporters, and other suppliers of goods, and bank credits covered by a guarantee of an export credit agency. Data are in current U.S. dollars.",
    "unit": "Current US$",
    "source": "World Bank, International Debt Statistics."
  }
}